<div class="about-card">
	<p class="fz-16 m-0 p-0 font-weight-bold">Согласие на обработку персональных данных</p>
	<hr class="hr-user-info">
	<p class="fz-14 m-0 p-0">
		Действуя свободно, своей волей и в своем интересе, а также подтверждая свою дееспособность, физическое лицо дает свое согласие сайту Statify.ru на обработку своих персональных данных со следующими условиями:<br>
		&nbsp;&nbsp;1. Данное Согласие дается на обработку персональных данных c момента прохождения пользователем регистрации на сайте Statify.ru.<br>
		&nbsp;&nbsp;2. Согласие дается на обработку следующих персональных данных пользователя: <br>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- фамилия, имя, отчество; <br>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- дата рождения; <br>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- адрес проживания (страна, город); <br>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- пол;<br>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- ссылки на страницы в социальных сетях; <br>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- адрес электронной почты; <br>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- никнейм. <br>
		&nbsp;&nbsp;3. Цель обработки персональных данных: регистрация пользователя на сайте Statify.ru. <br>
		&nbsp;&nbsp;4. В ходе обработки с персональными данными будут совершены следующие действия: сбор, систематизация; хранение; использование; извлечение; блокирование; уничтожение; запись; удаление; накопление; обновление; изменение. <br>
		&nbsp;&nbsp;5. Согласие может быть отозвано субъектом персональных данных или его представителем путем направления заявления по адресу электронной почты: support@ubeauty.ru.
	</p>
</div>