<div class="about-card">
	<p class="fz-20 m-0 p-0">Ограничения</p>
	<hr class="hr-user-info">
	<p class="fz-13 m-0 p-2 font-italic font-weight-bold about-remark">Некоторые ограничения носят временный характер и могут быть сняты по мере увеличения числа пользователей сайта.</p>
</div>

<div class="about-card mt-3">
	<div class="d-flex flex-row align-items-center m-0 p-0">
		<p class="fz-17 m-0 p-0 pr-3 mr-auto">Ограничение на возможность обновления фотографии профиля</p>
		<p class="m-0 p-0">
			<svg width="14px" height="14px" viewBox="0 0 24 24" fill="none">
				<path fill-rule="evenodd" clip-rule="evenodd" d="M5.5 10V7C5.5 5.27609 6.18482 3.62279 7.40381 2.40381C8.62279 1.18482 10.2761 0.5 12 0.5C13.7239 0.5 15.3772 1.18482 16.5962 2.40381C17.8152 3.62279 18.5 5.27609 18.5 7V10H19C20.6569 10 22 11.3431 22 13V20C22 21.6569 20.6569 23 19 23H5C3.34315 23 2 21.6569 2 20V13C2 11.3431 3.34315 10 5 10H5.5ZM9.52513 4.52513C10.1815 3.86875 11.0717 3.5 12 3.5C12.9283 3.5 13.8185 3.86875 14.4749 4.52513C15.1313 5.1815 15.5 6.07174 15.5 7V10H8.5V7C8.5 6.07174 8.86875 5.1815 9.52513 4.52513Z" fill="var(--main-text-color)"></path>
			</svg>
		</p>
	</div>
	<hr class="hr-user-info">
	<p class="fz-14 m-0 p-0">Для обновления фотографии профиля с момента последнего обновления должна пройти неделя.</p>
</div>

<div class="about-card mt-3">
	<div class="d-flex flex-row align-items-center m-0 p-0">
		<p class="fz-17 m-0 p-0 pr-3 mr-auto">Ограничение на возможность оценивать других пользователей сайта</p>
		<p class="m-0 p-0">
			<svg width="14px" height="14px" viewBox="0 0 24 24" fill="none">
				<path fill-rule="evenodd" clip-rule="evenodd" d="M5.5 10V7C5.5 5.27609 6.18482 3.62279 7.40381 2.40381C8.62279 1.18482 10.2761 0.5 12 0.5C13.7239 0.5 15.3772 1.18482 16.5962 2.40381C17.8152 3.62279 18.5 5.27609 18.5 7V10H19C20.6569 10 22 11.3431 22 13V20C22 21.6569 20.6569 23 19 23H5C3.34315 23 2 21.6569 2 20V13C2 11.3431 3.34315 10 5 10H5.5ZM9.52513 4.52513C10.1815 3.86875 11.0717 3.5 12 3.5C12.9283 3.5 13.8185 3.86875 14.4749 4.52513C15.1313 5.1815 15.5 6.07174 15.5 7V10H8.5V7C8.5 6.07174 8.86875 5.1815 9.52513 4.52513Z" fill="var(--main-text-color)"></path>
			</svg>
		</p>
	</div>
	<hr class="hr-user-info">
	<p class="fz-14 m-0 p-0">Для возможности оценивать других пользователей сайта текущему пользователю следует предварительно загрузить фотографию профиля, а также подтвердить свой email.</p>
</div>

<div class="about-card mt-3">
	<div class="d-flex flex-row align-items-center m-0 p-0">
		<p class="fz-17 m-0 p-0 pr-3 mr-auto">Ограничение на возможность удаления оставленного комментария</p>
		<p class="m-0 p-0">
			<svg width="14px" height="14px" viewBox="0 0 24 24" fill="none">
				<path fill-rule="evenodd" clip-rule="evenodd" d="M5.5 10V7C5.5 5.27609 6.18482 3.62279 7.40381 2.40381C8.62279 1.18482 10.2761 0.5 12 0.5C13.7239 0.5 15.3772 1.18482 16.5962 2.40381C17.8152 3.62279 18.5 5.27609 18.5 7V10H19C20.6569 10 22 11.3431 22 13V20C22 21.6569 20.6569 23 19 23H5C3.34315 23 2 21.6569 2 20V13C2 11.3431 3.34315 10 5 10H5.5ZM9.52513 4.52513C10.1815 3.86875 11.0717 3.5 12 3.5C12.9283 3.5 13.8185 3.86875 14.4749 4.52513C15.1313 5.1815 15.5 6.07174 15.5 7V10H8.5V7C8.5 6.07174 8.86875 5.1815 9.52513 4.52513Z" fill="var(--main-text-color)"></path>
			</svg>
		</p>
	</div>
	<hr class="hr-user-info">
	<p class="fz-14 m-0 p-0">Возможность удаления оставленного комментария доступна в течение суток с момента его создания.</p>
</div>
