<div class="about-card">
	<p class="fz-20 m-0 p-0">Правила</p>
	<hr class="hr-user-info">
	<p class="fz-13 m-0 p-2 font-italic font-weight-bold about-remark">За нарушением тех или иных правил сайта могут последовать временные блокировки страниц пользователей вплоть до вечного бана.</p>
	<hr class="hr-user-info">
	<p class="fz-14 m-0 p-0">- пишите грамотно;</p>
	<p class="fz-14 m-0 p-0">- недопустимы любые оскорбления в чью-либо сторону:</p>
	<p class="fz-14 m-0 p-0">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;прямые оскорбления</p>
	<p class="fz-14 m-0 p-0">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;оскорбления вопросом</p>
	<p class="fz-14 m-0 p-0">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;оскорбления групп пользователей</p>
	<p class="fz-14 m-0 p-0">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;оскорбление родственников и близких</p>
	<p class="fz-14 m-0 p-0">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;оскорбление национальности, расы, цвета кожи, политических взглядов и т.д.</p>
	<p class="fz-14 m-0 p-0">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;разжигание межнациональной розни;</p>
	<p class="fz-14 m-0 p-0">- не оставляйте бессмысленных комментариев;</p>
	<p class="fz-14 m-0 p-0">- старайтесь сводить к минимуму использование ненормативной лексики.</p>
</div>

<div class="about-card mt-3">
	<div class="d-flex align-items-center m-0 p-0">
		<p class="fz-17 m-0 p-0 pr-3 mr-auto">Неприемлемый и нежелательный контент</p>
	</div>
	<hr class="hr-user-info">
	<p class="fz-14 m-0 p-0">- флуд или спам в комментариях к фотографиям пользователей;</p>
	<p class="fz-14 m-0 p-0">- призывы к насилию или осуществлению экстремистской деятельности в комментариях к фотографиях пользователей;</p>
	<p class="fz-14 m-0 p-0">- способы самоубийства, побуждение к самоубийству;</p>
	<p class="fz-14 m-0 p-0">- размещение коммерческих вакансий;</p>
	<p class="fz-14 m-0 p-0">- реклама услуг сексуального характера;</p>
	<p class="fz-14 m-0 p-0">- реклама услуг и сторонних ресурсов;</p>
	<p class="fz-14 m-0 p-0">- распространение и оборот наркотических веществ, способы изготовления и употребления, побуждение к употреблению, положительный опыт употребления наркотиков;</p>
	<p class="fz-14 m-0 p-0">- изображения или упоминания детей, а также персонажей, изображенных похожими на детей, в сексуализированном контексте;</p>
	<p class="fz-14 m-0 p-0">- изображения полового акта;</p>
	<p class="fz-14 m-0 p-0">- порнография;</p>
	<p class="fz-14 m-0 p-0">- жесткий контент в положительном контексте, сцены изображения казней и пыток;</p>
	<p class="fz-14 m-0 p-0">- контент, внесенный в федеральные реестры запрещенных и экстремистских материалов;</p>
	<p class="fz-14 m-0 p-0">- ссылки, перенаправляющие пользователе на сайты, содержащие материалы запрещённые на территории Российской Федерации.</p>
</div>

<div class="about-card mt-3">
	<div class="d-flex align-items-center m-0 p-0">
		<p class="fz-17 m-0 p-0 pr-3 mr-auto">Теги</p>
	</div>
	<hr class="hr-user-info">
	<p class="fz-14 m-0 p-0">Теги должны описывать пользователя (хобби, сферы деятельности и т.д.) для его удобного поиска другими пользователями сайта со схожими интересами.</p>
</div>

<div class="about-card mt-3">
	<div class="d-flex align-items-center m-0 p-0">
		<p class="fz-17 m-0 p-0 pr-3 mr-auto">Забаненные пользователи</p>
	</div>
	<hr class="hr-user-info">
	<p class="fz-14 m-0 p-0">- после авторизации забаненные пользователи видят сообщение с причиной бана, включая дату прекращения бана в случае если получен временный бан;</p>
	<p class="fz-14 m-0 p-0">- фотографии пользователей, получивших бан, не попадаются другим пользователям сайта в разделе <a class="about-link" href="rate"><strong class="fz-14">Оценить</strong></a>;</p>
	<p class="fz-14 m-0 p-0">- другие пользователи сайта не могут оценивать фотографии пользователей получивших бан;</p>
	<p class="fz-14 m-0 p-0">- на время действия бана другие пользователи сайта не могут принять отправленные ранее заявки в друзья от пользователей, получивших бан.</p>
</div>