<div class="about-card">
	<p class="fz-16 m-0 p-0 font-weight-bold">Обновления</p>
</div>

<div class="d-flex flex-column p-0 pt-3 pb-3 w-100">
	<div class="about-card w-100">
		<div class="w-100 m-0 p-0 d-flex flex-row">
			<p class="fz-14 m-0 mr-auto p-0 font-weight-bold">Версия 2.0.0</p>
			<p class="fz-14 m-0 ml-auto p-0 font-weight-bold">15.04.2023</p>
		</div>
		<hr class="hr-user-info">
		<div class="w-100 m-0 p-0">
			<p class="fz-14 m-0 pb-1">- Изменён дизайн сайта:</p>
			<p class="fz-14 m-0 pb-1 pl-2">&#8901; добавлено поле ввода для поиска в шапке сайта</p>
			<p class="fz-14 m-0 pb-1 pl-2">&#8901; изменён дизайн главной страницы с профилем текущего пользователя</p>
			<p class="fz-14 m-0 pb-1 pl-2">&#8901; разделы "Фотографии" и "Сохранения" перенесены в раздел "Профиль"</p>
			<p class="fz-14 m-0 pb-1 pl-2">&#8901; модальные окна с информацией о пользователях заменены на страницы пользователей</p>
			<p class="fz-14 m-0 pb-1 pl-2">&#8901; изменён дизайн страницы авторизации и регистрации.</p>
			<p class="fz-14 m-0">- Добавлен выбор темы "Night forest".</p>
		</div>
	</div>
	<div class="about-card w-100 mt-3">
		<div class="w-100 m-0 p-0 d-flex flex-row">
			<p class="fz-14 m-0 mr-auto p-0 font-weight-bold">Версия 1.1.2</p>
			<p class="fz-14 m-0 ml-auto p-0 font-weight-bold">06.03.2023</p>
		</div>
		<hr class="hr-user-info">
		<div class="w-100 m-0 p-0">
			<p class="fz-14 m-0 pb-1">- В подразделе "Популярное" добавлен блок с новыми пользователями.</p>
			<p class="fz-14 m-0 pb-1">- Информация о пользователях перенесена в модальные окна.</p>
			<p class="fz-14 m-0 pb-1">- Добавлен выбор тем "Spotted" и "Ocean depths".</p>
			<p class="fz-14 m-0 pb-1">- Изменён дизайн разделов "Фотографии" и "Сохранения".</p>
			<p class="fz-14 m-0 pb-1">- В разделе "Оценить" добавлена возможность выбирать вариант просмотра содержимого (по одной фотографии или в виде галереи).</p>
			<p class="fz-14 m-0">- На странице с комментариями под фотографией добавлен блок с другими фотографиями пользователя.</p>
		</div>
	</div>
	<div class="about-card w-100 mt-3">
		<div class="w-100 m-0 p-0 d-flex flex-row">
			<p class="fz-14 m-0 mr-auto p-0 font-weight-bold">Версия 1.1.1</p>
			<p class="fz-14 m-0 ml-auto p-0 font-weight-bold">04.02.2023</p>
		</div>
		<hr class="hr-user-info">
		<div class="w-100 m-0 p-0">
			<p class="fz-14 m-0 pb-1">- Доработано окно со статистикой полученных оценок от пользователей в пробной версии премиум-аккаунта.</p>
			<p class="fz-14 m-0 pb-1">- Добавлена возможность отвечать на комментарии других пользователей.</p>
			<p class="fz-14 m-0 pb-1">- В разделе "Настройки" добавлена возможность выбирать кто может комментировать ваши фотографии.</p>
			<p class="fz-14 m-0 pb-1">- В разделе "Настройки" добавлена возможность выбирать кто может читать комментарии под вашими фотографиями.</p>
			<p class="fz-14 m-0 pb-1">- Исправлена ошибка при загрузке фотографии.</p>
			<p class="fz-14 m-0 pb-1">- В разделе "Новости" добавлен подраздел "Популярное".</p>
			<p class="fz-14 m-0 pb-1">- На главной странице пользователя добавлены блоки с количествами фотографий, сохранений и комментариев, оставленных пользователем.</p>
			<p class="fz-14 m-0 pb-1">- Добавлена возможность просмотра оставленных пользователем комментариев при выборе блока с количеством комментариев на главной странице пользователя.</p>
			<p class="fz-14 m-0 pb-1">- Возможность менять тему сайта перенесена в раздел "Настройки".</p>
			<p class="fz-14 m-0">- Добавлен выбор темы "Dark sapphire".</p>
		</div>
	</div>
	<div class="about-card w-100 mt-3">
		<div class="w-100 m-0 p-0 d-flex flex-row">
			<p class="fz-14 m-0 mr-auto p-0 font-weight-bold">Версия 1.1.0</p>
			<p class="fz-14 m-0 ml-auto p-0 font-weight-bold">12.01.2023</p>
		</div>
		<hr class="hr-user-info">
		<div class="w-100 m-0 p-0">
			<p class="fz-14 m-0 pb-1">- В разделе "Друзья" добавлен блок с возможными друзьями.</p>
			<p class="fz-14 m-0 pb-1">- В разделе "Настройки" добавлена возможность выбирать кто может оценивать ваши фотографии.</p>
			<p class="fz-14 m-0 pb-1">- Добавлена возможность просматривать общих друзей с другими пользователями.</p>
			<p class="fz-14 m-0 pb-1">- Улучшено главное меню в мобильной версии сайта.</p>
			<p class="fz-14 m-0">- Добавлена возможность получить пробную версию премиум-аккаунта сроком на один месяц.</p>
		</div>
	</div>
	<div class="about-card w-100 mt-3">
		<div class="w-100 m-0 p-0 d-flex flex-row">
			<p class="fz-14 m-0 mr-auto p-0 font-weight-bold">Версия 1.0.0</p>
			<p class="fz-14 m-0 ml-auto p-0 font-weight-bold">07.12.2022</p>
		</div>
		<hr class="hr-user-info">
		<div class="w-100 m-0 p-0">
			<p class="fz-14 m-0">Запуск сайта Statify.ru</p>
		</div>
	</div>
</div>