<div class="m-0 p-2 pl-3 pr-3 d-flex flex-row align-items-center">
  <div class="m-0 p-0 pt-1 pb-1 mr-auto d-flex flex-row">
    <p class="m-0 p-0 d-flex flex-row align-items-center justify-content-center pointer" data-toggle="tooltip" data-placement="bottom" title="Комментарии: <?= ($comments_list) ? number_format(count($comments_list), 0, ',', '.') : 0; ?>">
      <svg class="m-0 p-0" fill="var(--main-text-color)" width="20px" height="20px" viewBox="0 -3.5 31 31">
        <path d="m12 2.182c-.031 0-.068 0-.105 0-1.715 0-3.354.325-4.859.918l.09-.031c-1.425.526-2.633 1.347-3.599 2.394l-.006.006c-.809.847-1.314 1.99-1.338 3.251v.005c.013 1.015.35 1.948.912 2.705l-.009-.012c.675.923 1.522 1.678 2.5 2.229l.039.02 1.654.958-.597 1.432q.579-.341 1.057-.665l.75-.528.903.17c.783.15 1.684.237 2.606.24h.002.105c1.715 0 3.354-.325 4.859-.918l-.09.031c1.425-.526 2.633-1.347 3.599-2.394l.006-.006c.827-.836 1.338-1.986 1.338-3.256s-.511-2.42-1.338-3.256c-.972-1.053-2.18-1.874-3.542-2.379l-.063-.021c-1.421-.566-3.067-.895-4.79-.895-.03 0-.06 0-.09 0h.005zm0-2.182c.045 0 .098-.001.151-.001 2.119 0 4.138.429 5.974 1.206l-.101-.038c1.751.703 3.22 1.789 4.358 3.161l.014.018c.996 1.174 1.602 2.706 1.602 4.38s-.606 3.207-1.61 4.39l.008-.01c-1.152 1.389-2.621 2.475-4.299 3.152l-.073.026c-1.736.739-3.756 1.169-5.875 1.169-.053 0-.105 0-.157-.001h.008c-1.062-.003-2.099-.102-3.106-.289l.106.016c-1.352.964-2.934 1.714-4.64 2.158l-.1.022c-.389.1-.886.195-1.391.264l-.074.008h-.051c-.135-.002-.257-.053-.35-.136-.105-.088-.177-.213-.196-.355v-.003c-.011-.032-.017-.069-.017-.107 0-.001 0-.002 0-.004 0-.001 0-.001 0-.002 0-.038.003-.076.009-.113l-.001.004c.007-.038.019-.073.035-.104l-.001.002.042-.086.06-.094.068-.086.08-.086.068-.08q.086-.102.392-.426t.443-.503.383-.494c.152-.191.293-.406.415-.633l.011-.023q.179-.341.35-.75c-1.342-.759-2.454-1.773-3.303-2.985l-.021-.032c-.753-1.063-1.207-2.384-1.214-3.811v-.002c.008-1.673.611-3.203 1.609-4.391l-.009.011c1.152-1.389 2.621-2.475 4.299-3.152l.073-.026c1.736-.739 3.756-1.169 5.875-1.169.054 0 .107 0 .161.001h-.008zm14.01 19.925q.17.409.35.75c.133.25.274.465.433.665l-.007-.009q.247.315.383.494t.443.503q.306.32.392.426.017.017.068.08t.08.086c.024.026.046.054.066.083l.002.002c.02.027.04.058.058.09l.002.004.042.086.034.102.009.11-.017.11c-.029.152-.108.282-.22.374l-.001.001c-.089.075-.205.121-.331.121-.015 0-.031-.001-.046-.002h.002c-2.356-.314-4.462-1.187-6.243-2.482l.039.027c-.901.171-1.938.27-2.998.273h-.002c-.099.002-.216.004-.334.004-2.863 0-5.53-.84-7.767-2.287l.056.034q.989.068 1.5.068h.067c1.855 0 3.644-.28 5.327-.801l-.128.034c1.716-.516 3.212-1.266 4.544-2.229l-.044.03c1.336-.962 2.431-2.169 3.24-3.563l.029-.055c.718-1.244 1.142-2.736 1.142-4.327 0-.926-.143-1.818-.409-2.655l.017.062c1.401.751 2.564 1.773 3.457 3.004l.02.029c.799 1.084 1.278 2.446 1.278 3.921 0 1.433-.453 2.76-1.224 3.846l.014-.021c-.872 1.24-1.984 2.251-3.275 2.983l-.05.026z"></path>
      </svg>
      <span class="fz-14 m-0 ml-2 p-0 font-weight-bold"><?= ($comments_list) ? rounding_number_by_places(count($comments_list)) : 0; ?></span>
    </p>
    <p class="m-0 ml-3 p-0 d-flex flex-row align-items-center justify-content-center pointer" data-toggle="tooltip" data-placement="bottom" title="Всего оценок: <?= number_format(get_current_photo_ratings_count($photo_uuid), 0, ',', '.'); ?> ">
      <svg class="m-0 p-0" width="20px" height="20px" viewBox="0 0 24 24" fill="none">
        <path d="M11.0748 3.25583C11.4141 2.42845 12.5859 2.42845 12.9252 3.25583L14.6493 7.45955C14.793 7.80979 15.1221 8.04889 15.4995 8.07727L20.0303 8.41798C20.922 8.48504 21.2841 9.59942 20.6021 10.1778L17.1369 13.1166C16.8482 13.3614 16.7225 13.7483 16.8122 14.1161L17.8882 18.5304C18.1 19.3992 17.152 20.0879 16.3912 19.618L12.5255 17.2305C12.2034 17.0316 11.7966 17.0316 11.4745 17.2305L7.60881 19.618C6.84796 20.0879 5.90001 19.3992 6.1118 18.5304L7.18785 14.1161C7.2775 13.7483 7.1518 13.3614 6.86309 13.1166L3.3979 10.1778C2.71588 9.59942 3.07796 8.48504 3.96971 8.41798L8.50046 8.07727C8.87794 8.04889 9.20704 7.80979 9.35068 7.45955L11.0748 3.25583Z" stroke="var(--main-text-color)" stroke-width="2"></path>
      </svg>
      <span class="fz-14 m-0 ml-2 p-0 font-weight-bold"><?= rounding_number_by_places(get_current_photo_ratings_count($photo_uuid)); ?></span>
    </p>
  </div>
<?
  if (get_user_avatar($user_uuid))
    if ((!check_only_friends_can_comment_photos($photo_user_uuid) && !check_only_friends_can_read_comments_on_photos($photo_user_uuid)) ||
        ($user_uuid == $photo_user_uuid) ||
        (check_only_friends_can_comment_photos($photo_user_uuid) && user_friendly_status($user_uuid, $photo_user_uuid) == 'friend') ||
        (check_only_friends_can_read_comments_on_photos($photo_user_uuid) && user_friendly_status($user_uuid, $photo_user_uuid) == 'friend'))
      echo '<div class="ml-auto m-0 p-0 h-100 current-photo-menu" 
                  id="add-comment-btn" 
                  onclick="addCommentBlock(\''.$photo_uuid.'\',\''.$user_uuid.'\');">
              <div class="nav-item m-0 p-1">
                <a class="nav-link m-0 p-0 text-center d-flex flex-row justify-content-center align-items-center">
                  <p class="m-0 p-0">
                    <svg id="show-comment-text-field-icon" aria-hidden="true" fill="var(--main-text-color)" width="20px" height="20px" viewBox="0 -2 28 28">
                      <path d="m10 10c0 1.105-.895 2-2 2-1.104 0-2-.896-2-2s.895-2 2-2c.552 0 1.052.224 1.414.586.361.351.586.841.586 1.384v.032zm6 0c0 1.105-.895 2-2 2-.552 0-1.052-.224-1.414-.586-.377-.364-.611-.874-.611-1.439 0-1.105.895-2 2-2 .565 0 1.074.234 1.438.61l.001.001c.362.351.587.841.587 1.385v.031-.002zm6 0c0 1.104-.896 2-2 2s-2-.895-2-2 .895-2 2-2c.552 0 1.052.224 1.414.586.361.351.586.841.586 1.384v.032zm-8-8c-.038 0-.083-.001-.128-.001-2.098 0-4.102.399-5.942 1.124l.11-.038c-1.74.644-3.217 1.645-4.4 2.922l-.007.007c-.99 1.036-1.608 2.436-1.633 3.98v.005c.013 1.258.432 2.415 1.131 3.351l-.011-.015c.835 1.131 1.885 2.053 3.096 2.719l.049.025 1.36.782-.426 1.498c-.272 1.021-.646 1.915-1.122 2.741l.029-.054c1.651-.691 3.071-1.59 4.313-2.686l-.017.014.672-.594.89.094c.607.077 1.312.122 2.028.125h.004c.038 0 .083.001.128.001 2.098 0 4.102-.399 5.942-1.124l-.11.038c1.74-.644 3.217-1.645 4.4-2.922l.007-.007c1.009-1.025 1.632-2.432 1.632-3.984s-.623-2.96-1.633-3.985l.001.001c-1.19-1.284-2.666-2.286-4.329-2.904l-.078-.025c-1.73-.687-3.735-1.086-5.833-1.086-.044 0-.088 0-.132.001h.007zm14 8c-.012 1.924-.72 3.681-1.884 5.033l.009-.01c-1.349 1.592-3.059 2.837-5.008 3.611l-.086.03c-2.023.846-4.374 1.337-6.839 1.337-.068 0-.135 0-.202-.001h.01c-.8-.002-1.588-.047-2.363-.134l.097.009c-1.981 1.759-4.399 3.072-7.069 3.756l-.118.026c-.503.145-1.107.266-1.726.339l-.055.005h-.08c-.163 0-.311-.062-.422-.164-.123-.111-.212-.258-.249-.424l-.001-.005v-.016c-.017-.029-.027-.064-.027-.102 0-.033.008-.063.021-.091l-.001.001c.02-.047.031-.101.031-.159 0-.001 0-.001 0-.002q-.008-.031.07-.149l.094-.141.11-.133.125-.141q.11-.125.484-.539l.539-.594q.164-.18.484-.617c.174-.231.343-.493.491-.767l.017-.033q.187-.359.422-.922c.137-.317.276-.712.39-1.117l.017-.07c-1.558-.861-2.852-2.018-3.844-3.405l-.024-.035c-.878-1.216-1.407-2.735-1.414-4.377v-.002c.005-1.438.418-2.779 1.128-3.914l-.018.031c.781-1.276 1.778-2.34 2.951-3.173l.033-.022c1.281-.904 2.766-1.632 4.361-2.105l.108-.027c1.603-.501 3.446-.789 5.357-.789h.085-.004.083c1.911 0 3.754.288 5.488.824l-.132-.035c1.703.501 3.188 1.229 4.517 2.165l-.048-.032c1.206.855 2.203 1.92 2.958 3.149l.026.046c.691 1.104 1.103 2.445 1.107 3.882v.001z"></path>
                    </svg>
                  </p>
                  <p class="fz-13 p-1 m-0 font-weight-bold" id="show-comment-text-field-p">Добавить комментарий</p>
                </a>
              </div>
            </div>
            <div class="ml-auto m-0 p-0 h-100 current-photo-menu del-comment-btn-hide" 
                  id="del-comment-btn" 
                  onclick="delCommentBlock();">
              <div class="nav-item m-0 p-1">
                <a class="nav-link m-0 p-0 text-center d-flex flex-row justify-content-center align-items-center">
                  <p class="m-0 p-0" id="hide-comment-text-field-icon" aria-hidden="true">
                    <svg viewBox="0 0 48 48" width="20px" height="20px" class="svg-close-icon">
                      <rect width="48" height="48" fill="none"></rect>
                      <path d="M26.8,24,37.4,13.5a2.1,2.1,0,0,0,.2-2.7,1.9,1.9,0,0,0-3-.2L24,21.2,13.4,10.6a1.9,1.9,0,0,0-3,.2,2.1,2.1,0,0,0,.2,2.7L21.2,24,10.6,34.5a2.1,2.1,0,0,0-.2,2.7,1.9,1.9,0,0,0,3,.2L24,26.8,34.6,37.4a1.9,1.9,0,0,0,3-.2,2.1,2.1,0,0,0-.2-2.7Z"></path>
                    </svg>
                  </p>
                  <p class="fz-13 p-1 m-0 font-weight-bold" id="hide-comment-text-field-p">Скрыть</p>
                </a>
              </div>
            </div>';
?>
</div>
<?
  $message_for_users = '';

  if (check_only_friends_can_comment_photos($photo_user_uuid) && 
      ($user_uuid != $photo_user_uuid) && user_friendly_status($user_uuid, $photo_user_uuid) != 'friend')
    $message_for_users = '<hr class="hr-user-info m-0"><p class="w-100 fz-14 m-0 mt-2 mb-2 p-0 pl-4 pr-4 text-center font-italic">Пользователь ограничил комментирование своих фотографий</p>';
  
  if (check_only_friends_can_read_comments_on_photos($photo_user_uuid) &&
      ($user_uuid != $photo_user_uuid) && user_friendly_status($user_uuid, $photo_user_uuid) != 'friend') 
    $message_for_users = '<hr class="hr-user-info m-0"><p class="w-100 fz-14 m-0 mt-2 mb-2 p-0 pl-4 pr-4 text-center font-italic">Пользователь ограничил чтение комментариев под своими фотографиями</p>';
  
  if (check_only_friends_can_comment_photos($photo_user_uuid) && check_only_friends_can_read_comments_on_photos($photo_user_uuid) &&
      ($user_uuid != $photo_user_uuid) && user_friendly_status($user_uuid, $photo_user_uuid) != 'friend')
    $message_for_users = '<hr class="hr-user-info m-0"><p class="w-100 fz-14 m-0 mt-2 mb-2 p-0 pl-4 pr-4 text-center font-italic">Пользователь ограничил комментирование и чтение комментариев других пользователей под своими фотографиями</p>';
  
  echo $message_for_users;
?>